renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx72m/r_qspi_smstr_target.c
/*******************************************************************************
* Function Name: r_qspi_smstr_rx_disable
* Description  : Disables QSPI reception.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_rx_disable(uint8_t channel)
{
    r_qspi_smstr_mpc_disable(channel);              /* MPC : use as general I/O port.                           */
    QSPI_SPCR(channel)  = QSPI_SPCR_INIT;           /* Disable reception.                                       */
    if (QSPI_SPCR_INIT == QSPI_SPCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    r_qspi_smstr_spsr_clear(channel);               /* Clear status flag of QSPI.                               */
    QSPI_SPSCR(channel) = QSPI_SPSCR_INIT;          /* Initialize sequence length.                              */
    if (QSPI_SPSCR_INIT == QSPI_SPSCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_buffer_reset
* Description  : Resets transmit and receive buffer of QSPI.
* Arguments    : channel -
*                    Which channel to use.
* Return Value : none
*******************************************************************************/
static void r_qspi_smstr_buffer_reset(uint8_t channel)
{
    QSPI_SPBFCR(channel)    = QSPI_SPBFCR_RST;      /* Reset transmit and receive buffer.                       */
    if (QSPI_SPBFCR_RST == QSPI_SPBFCR(channel))
    {
        /* According to specifications of QSPI,
           if write SPBFCR, must execute dummy reading. */
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    QSPI_SPBFCR(channel)    = QSPI_SPBFCR_INIT;     /* Allow transmit and receive buffer normal operation.      */
    if (QSPI_SPBFCR_INIT == QSPI_SPBFCR(channel))
    {
        /* According to specifications of QSPI,
           if write SPBFCR, must execute dummy reading. */
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_datasize_set
* Description  : Sets data size to the SFR for QSPI.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data.
* Return Value : none
*******************************************************************************/
static void r_qspi_smstr_datasize_set(uint8_t channel, uint32_t size)
{
    if ((QSPI_FIFO_HALF_SIZE <= size) && (0 != (QSPI_FIFO_CHK & size)))
    {
        /* ---- Size of data : (16 * m) + n bytes (m=0x00000001~0x0FFFFFFF, n=0x00000001~0x0000000F) ---- */
        QSPI_SPBFCR(channel)    = QSPI_SPBFCR_FIFO_HALF_SIZE;           /* Buffer triggering number : 16 bytes  */
        if (QSPI_SPBFCR_FIFO_HALF_SIZE == QSPI_SPBFCR(channel))
        {
            /* According to specifications of QSPI,
               if write SPBFCR, must execute dummy reading. */
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
        QSPI_SPB0(channel)      = SPCMD_SPB_LONG;                       /* Transfer data length : 32 bits       */

        /* Cast the variable to a uint32_t type. */
        QSPI_SPBMUL0(channel) = (uint32_t)((size / QSPI_FIFO_HALF_SIZE) * (QSPI_FIFO_HALF_SIZE / QSPI_SMSTR_TRAN_SIZE));
                                                                        /* Number of times to transfer 32 bits. */
        QSPI_SPB1(channel)      = SPCMD_SPB_BYTE;                       /* Transfer data length : 8 bits        */

        /* Cast the variable to a uint32_t type. */
        QSPI_SPBMUL1(channel)   = (uint32_t)(size % QSPI_FIFO_HALF_SIZE);
                                                                        /* Number of times to transfer 8 bits.  */
        if (0 == QSPI_SPBMUL1(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
    else if ((QSPI_FIFO_HALF_SIZE <= size) && (0 == (QSPI_FIFO_CHK & size)))
    {
        /* ---- Size of data : (16 * m) bytes (m=0x00000001~0x0FFFFFFF) ---- */
        QSPI_SPBFCR(channel)    = QSPI_SPBFCR_FIFO_HALF_SIZE;           /* Buffer triggering number : 16 bytes  */
        if (QSPI_SPBFCR_FIFO_HALF_SIZE == QSPI_SPBFCR(channel))
        {
            /* According to specifications of QSPI,
               if write SPBFCR, must execute dummy reading. */
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
        QSPI_SPB0(channel)      = SPCMD_SPB_LONG;                       /* Transfer data length : 32 bits       */

        /* Cast the variable to a uint32_t type. */
        QSPI_SPBMUL0(channel) = (uint32_t)((size / QSPI_FIFO_HALF_SIZE) * (QSPI_FIFO_HALF_SIZE / QSPI_SMSTR_TRAN_SIZE));
                                                                        /* Number of times to transfer 32 bits. */
        if (0 == QSPI_SPBMUL0(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
    else
    {
        /* ---- Size of data : n bytes (n=0x00000001~0x0000000F) ---- */
        QSPI_SPBFCR(channel)    = QSPI_SPBFCR_BYTE;                     /* Buffer triggering number : 1 byte    */
        if (QSPI_SPBFCR_BYTE == QSPI_SPBFCR(channel))
        {
            /* According to specifications of QSPI,
               if write SPBFCR, must execute dummy reading. */
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
        QSPI_SPB0(channel)      = SPCMD_SPB_BYTE;                       /* Transfer data length : 8 bits        */

        /* Cast the variable to a uint32_t type */
        QSPI_SPBMUL0(channel)   = (uint32_t)(size);                     /* Number of times to transfer 8 bits.  */
        if (0 == QSPI_SPBMUL0(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_get_buffregaddress
* Description  : Gets address of QSPI data register (SPDR).
* Arguments    : channel -
*                    Which channel to use
*                p_spdr_adr -
*                    Address of QSPI data register (SPDR)
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_get_buffregaddress(uint8_t channel, uint32_t *p_spdr_adr)
{
    *p_spdr_adr = (uint32_t)(&QSPI_SPDR_LONG(channel));
}


#endif /* defined(BSP_MCU_RX72M) */

/* End of File */

